# BaseElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stairs..::..BaseElevation Property
Stairs Class See Also
---
The base elevation of the stairs.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double BaseElevation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BaseElevation As Double
	Get
```

Visual C++
---
```text
public:
property double BaseElevation {
	double get ();
}
```

# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace